Repository: thanhnhan0710/production_app_frontend
Catalog: lib/l10n/app_*.arb
Languages: vi

# loginTitle
source: Login
vi: Đăng nhập

source: Username
vi: Tên đăng nhập

source: Password
vi: Mật khẩu

# btnLogin
source: LOGIN
vi: ĐĂNG NHẬP

# welcome
source: Welcome {name}
vi: Xin chào {name}

# companyName
source: OPPERMANN VIETNAM CO., LTD.
vi: CÔNG TY TNHH OPPERMANN VIỆT NAM

# erpSystemName
source: Enterprise Resource Planning System
vi: Hệ thống Quản trị Nguồn lực Doanh nghiệp

# loginSystemHeader
source: Login System
vi: Đăng nhập Hệ thống

# loginSubtitle
source: Sign in to continue to ERP System
vi: Vui lòng đăng nhập để truy cập ERP

# copyright
source: Â© 2026 Oppermann Vietnam
vi: © 2026 Oppermann Việt Nam

# errorRequired
source: This field is required
vi: Vui lòng không để trống

# errorLoginFailed
source: Login failed. Please check your credentials.
vi: Đăng nhập thất bại. Vui lòng kiểm tra lại tài khoản.

# errorNetwork
source: Network error. Please check your connection.
vi: Lỗi kết nối. Vui lòng kiểm tra mạng hoặc Server.

# errorGeneric
source: A system error occurred
vi: Đã xảy ra lỗi hệ thống

source: Dashboard
vi: Tổng quan

source: Production
vi: Sản xuất

source: Inventory
vi: Kho vận

source: Sales
vi: Bán hàng

# hr
source: Human Resources
vi: Nhân sự

source: Reports
vi: Báo cáo

source: Settings
vi: Cài đặt

source: Logout
vi: Đăng xuất

source: Total Orders
vi: Tổng đơn hàng

source: Active Plans
vi: Kế hoạch đang chạy

# lowStock
source: Low Stock Items
vi: Sắp hết hàng

source: Revenue
vi: Doanh thu

source: Recent Activities
vi: Hoạt động gần đây

source: View All
vi: Xem tất cả

source: Save
vi: Lưu

source: Cancel
vi: Hủy

source: Confirm
vi: Xác nhận

source: Close
vi: Đóng

source: Delete
vi: Xóa

source: Actions
vi: Hành động

source: Required
vi: Bắt buộc

# successAdded
source: Added successfully
vi: Thêm thành công

# successUpdated
source: Updated successfully
vi: Cập nhật thành công

# successDeleted
source: Deleted successfully
vi: Xóa thành công

source: Contact
vi: Liên hệ

source: Note
vi: Ghi chú

# departmentTitle
source: Departments
vi: Quản lý Bộ phận

# deptName
source: Department Name
vi: Tên bộ phận

# deptDesc
source: Description
vi: Mô tả

# searchDept
source: Search Department...
vi: Tìm kiếm bộ phận...

# addDept
source: Add Department
vi: Thêm bộ phận

# editDept
source: Edit Department
vi: Sửa bộ phận

# deleteDept
source: Delete Department
vi: Xóa bộ phận

# confirmDelete
source: Are you sure you want to delete {name}?
vi: Bạn có chắc muốn xóa bộ phận {name} không?

# employeeTitle
source: Employees
vi: Nhân viên

source: Full Name
vi: Họ và tên

source: Phone
vi: Số điện thoại

source: Address
vi: Địa chỉ

source: Position
vi: Chức vụ

source: Department
vi: Phòng ban

source: Search employee...
vi: Tìm nhân viên...

source: Add Employee
vi: Thêm nhân viên

source: Edit Employee
vi: Sửa nhân viên

source: Delete Employee
vi: Xóa nhân viên

# confirmDeleteEmployee
source: Delete employee {name}?
vi: Xóa nhân viên {name}?

# selectDept
source: Select Department
vi: Chọn phòng ban

source: Total Departments
vi: Tổng số bộ phận

source: Status
vi: Trạng thái

source: Active
vi: Hoạt động

source: Inactive
vi: Ngưng hoạt động

source: Members
vi: Thành viên

# supplierTitle
source: Suppliers
vi: Nhà cung cấp

source: Supplier Name
vi: Tên nhà cung cấp

source: Search supplier...
vi: Tìm nhà cung cấp...

source: Add Supplier
vi: Thêm nhà cung cấp

source: Edit Supplier
vi: Sửa nhà cung cấp

source: Delete Supplier
vi: Xóa nhà cung cấp

# confirmDeleteSupplier
source: Are you sure you want to delete {name}?
vi: Bạn có chắc muốn xóa {name} không?

# yarnTitle
source: Yarn Inventory
vi: Kho Sợi

source: Yarn Name
vi: Tên sợi

source: Item Code
vi: Mã sản phẩm

# yarnType
source: Type
vi: Loại sợi

source: Color
vi: Màu sắc

source: Origin
vi: Xuất xứ

source: Supplier
vi: Nhà cung cấp

# searchYarn
source: Search yarn (name, code)...
vi: Tìm sợi (tên, mã)...

source: Add Yarn
vi: Thêm sợi

source: Edit Yarn
vi: Sửa sợi

source: Delete Yarn
vi: Xóa sợi

# confirmDeleteYarn
source: Delete yarn {name}?
vi: Xóa sợi {name}?

source: Select Supplier
vi: Chọn nhà cung cấp

# noYarnFound
source: No yarn items found
vi: Không tìm thấy dữ liệu sợi

# yarnLotTitle
source: Yarn Lots
vi: Lô Sợi

source: Lot Code
vi: Mã lô

source: Import Date
vi: Ngày nhập

source: Total (kg)
vi: Tổng kg

# rollCount
source: Rolls
vi: Số cuộn

# warehouseLoc
source: Location
vi: Vị trí kho

# containerCode
source: Container
vi: Số container

source: Driver
vi: Tài xế

source: Receiver
vi: Người nhận

# searchYarnLot
source: Search lot code...
vi: Tìm mã lô...

source: Add Yarn Lot
vi: Nhập lô sợi

source: Edit Yarn Lot
vi: Sửa lô sợi

source: Delete Yarn Lot
vi: Xóa lô sợi

# confirmDeleteYarnLot
source: Delete yarn lot {code}?
vi: Xóa lô {code}?

source: Select Yarn
vi: Chọn loại sợi

source: Select Employee
vi: Chọn nhân viên

# materialTitle
source: Materials
vi: Nguyên vật liệu

# materialMaster
source: Materials Master
vi: Danh mục Vật tư

# materialBreadcrumb
source: Inventory > Materials
vi: Kho vận > Vật tư

source: Material Name
vi: Tên Vật Tư

source: Material Code
vi: Mã VT

# materialType
source: Type
vi: Loại

source: Quantity
vi: Số lượng

source: Unit
vi: Đơn vị

source: Imported By
vi: Người nhập

source: Search material...
vi: Tìm vật liệu...

# searchMaterialHint
source: Search Code, Name...
vi: Tìm Mã, Tên...

source: Total Materials
vi: Tổng vật tư

source: Add Material
vi: Thêm Vật tư

source: Edit Material
vi: Sửa vật liệu

source: Delete Material
vi: Xóa vật liệu

# confirmDeleteMaterial
source: Delete material {name}?
vi: Xóa vật liệu {name}?

# noMaterialFound
source: No materials found
vi: Không tìm thấy vật liệu

source: Select Importer
vi: Chọn nguyên vật liệu

source: Select Unit
vi: Chọn đơn vị

source: HS Code
vi: Mã HS

# denierHint
source: Denier (e.g 1000D)
vi: Denier (VD: 1000D)

source: Filament
vi: Số sợi (Filament)

source: Min Stock
vi: Tồn tối thiểu

# uomBasePurchase
source: UOM Purchase (Base)
vi: ĐVT Mua (Gốc)

source: UOM Production
vi: ĐVT Sản xuất

source: UOM (B/P)
vi: ĐVT (Mua/SX)

source: Specs
vi: Thông số kỹ thuật

# unitTitle
source: Units of Measurement
vi: Đơn vị tính

source: Unit Name
vi: Tên đơn vị

source: Search unit...
vi: Tìm đơn vị...

source: Add Unit
vi: Thêm đơn vị

source: Edit Unit
vi: Sửa đơn vị

source: Delete Unit
vi: Xóa đơn vị

# confirmDeleteUnit
source: Delete unit {name}?
vi: Xóa đơn vị {name}?

# noUnitFound
source: No units found
vi: Không tìm thấy đơn vị nào

# machineTitle
source: Machines
vi: Máy móc thiết bị

source: Machine Name
vi: Tên máy

source: Total Lines
vi: Số dây/line

source: Purpose
vi: Mục đích sử dụng

source: AREA
vi: Khu vực

source: Search machine...
vi: Tìm máy...

source: Add Machine
vi: Thêm máy

source: Edit Machine
vi: Sửa thông tin máy

source: Delete Machine
vi: Xóa máy

# confirmDeleteMachine
source: Delete machine {name}?
vi: Xóa máy {name}?

# noMachineFound
source: No machines found
vi: Không tìm thấy máy nào

source: Running
vi: Đang chạy

source: Stopped
vi: Đang dừng

source: Maintenance
vi: Bảo trì

source: Unassigned Area
vi: Khu vực chung

# statusRunning
source: Running
vi: Chạy máy

# statusSpinning
source: Spinning
vi: Lên sợi

# statusStopped
source: Stopped
vi: Dừng / Lỗi

# statusMaintenance
source: Maintenance
vi: Bảo trì

source: View History
vi: Xem lịch sử

# machineHistoryTitle
source: History: {name}
vi: Lịch sử: {name}

# noHistoryData
source: No activity history available.
vi: Chưa có lịch sử hoạt động.

# reasonLabel
source: Reason: {reason}
vi: Lý do: {reason}

# durationFormatMin
source: {min} min
vi: {min} phút

# durationFormatHour
source: {hour}h {min}m
vi: {hour}h {min}p

# timeCurrent
source: Now
vi: Hiện tại

# changeStatusTitle
source: Change Status: {status}
vi: Đổi trạng thái: {status}

# confirmStatusChangeMsg
source: Do you want to change machine {name} to {status}?
vi: Bạn muốn chuyển máy {name} sang {status}?

# reasonIssue
source: Reason / Issue Description
vi: Lý do / Mô tả sự cố

# enterReason
source: Enter reason (e.g. Broken thread, Motor failure...)
vi: Nhập lý do dừng máy... (VD: Đứt sợi, Hỏng motor...)

# reasonRequired
source: Please enter a reason
vi: Vui lòng nhập lý do

source: Capture Evidence
vi: Chụp ảnh hiện trường

source: Opening Camera...
vi: Đang mở Camera...

# cameraFeatureDev
source: Camera feature is under development
vi: Tính năng chụp ảnh đang phát triển

# shiftTitle
source: Work Shifts
vi: Ca làm việc

source: Shift Name
vi: Tên ca

source: Search shift...
vi: Tìm ca làm việc...

source: Add Shift
vi: Thêm ca

source: Edit Shift
vi: Sửa ca

source: Delete Shift
vi: Xóa ca

# confirmDeleteShift
source: Delete shift {name}?
vi: Xóa ca {name}?

# noShiftFound
source: No shifts found
vi: Không tìm thấy ca làm việc

# basketTitle
source: Baskets
vi: Rổ chứa

source: Basket Code
vi: Mã rổ

# basketTitleVS2
source: Basket
vi: Rổ

# tareWeight
source: Tare Weight (kg)
vi: Trọng lượng bì (kg)

source: Search basket...
vi: Tìm mã rổ...

source: Add Basket
vi: Thêm rổ

source: Edit Basket
vi: Sửa rổ

source: Delete Basket
vi: Xóa rổ

# confirmDeleteBasket
source: Delete basket {code}?
vi: Xóa rổ {code}?

# noBasketFound
source: No baskets found
vi: Không tìm thấy rổ nào

# basketFound
source: Basket Found: {code}
vi: Đã tìm thấy rổ: {code}

source: Basket not found or NOT READY
vi: Không tìm thấy rổ hoặc rổ chưa sẵn sàng

# stReady
source: Ready
vi: Sẵn sàng

# stInUse
source: In Use
vi: Đang sử dụng

# stHolding
source: Holding
vi: Đang lưu kho

# stDamaged
source: Damaged
vi: Hư hỏng

# dyeColorTitle
source: Dye Colors
vi: Màu nhuộm

source: Color Name
vi: Tên màu

source: Hex Code
vi: Mã màu (Hex)

source: Search color...
vi: Tìm màu...

source: Add Color
vi: Thêm màu

source: Edit Color
vi: Sửa màu

source: Delete Color
vi: Xóa màu

# confirmDeleteColor
source: Delete color {name}?
vi: Xóa màu {name}?

# noColorFound
source: No colors found
vi: Không tìm thấy màu nào

# invalidHex
source: Invalid Hex Code (e.g., #FF0000)
vi: Mã màu không hợp lệ (VD: #FF0000)

# productTitle
source: Products
vi: Sản phẩm

# productImage
source: Image
vi: Hình ảnh

source: Search product...
vi: Tìm sản phẩm...

source: Add Product
vi: Thêm sản phẩm

source: Edit Product
vi: Sửa sản phẩm

source: Delete Product
vi: Xóa sản phẩm

# confirmDeleteProduct
source: Delete product {code}?
vi: Xóa sản phẩm {code}?

# noProductFound
source: No products found
vi: Không tìm thấy sản phẩm

source: Upload Image
vi: Tải ảnh lên

# standardTitle
source: Standards
vi: Tiêu chuẩn

source: Standard Code
vi: Mã tiêu chuẩn

source: Product
vi: Sản phẩm

source: Dye Color
vi: Màu nhuộm

# width
source: Width (mm)
vi: Khổ (mm)

# thickness
source: Thickness (mm)
vi: Độ dày (mm)

# strength
source: Strength (daN)
vi: Lực đứt (daN)

source: Elongation (%)
vi: Độ giãn (%)

# colorFastDry
source: Color Fastness (Dry)
vi: Bền màu (Khô)

# colorFastWet
source: Color Fastness (Wet)
vi: Bền màu (Ướt)

source: Delta E
vi: Sai lệch màu (Delta E)

source: Appearance
vi: Ngoại quan

# weftDensity
source: Weft Density (pick/10cm)
vi: Mật độ ngang (pick/10cm)

# weight
source: Weight (g/m)
vi: Trọng lượng (g/m)

source: Search standard...
vi: Tìm tiêu chuẩn...

source: Add Standard
vi: Thêm tiêu chuẩn

source: Edit Standard
vi: Sửa tiêu chuẩn

source: Delete Standard
vi: Xóa tiêu chuẩn

# confirmDeleteStandard
source: Delete standard {code}?
vi: Xóa tiêu chuẩn {code}?

# noStandardFound
source: No standards found
vi: Không tìm thấy tiêu chuẩn

# scheduleTitle
source: Work Schedules
vi: Lịch làm việc

source: Work Date
vi: Ngày làm việc

source: Employee
vi: Nhân viên

source: Shift
vi: Ca làm việc

source: Start Time
vi: Giờ bắt đầu

source: End Time
vi: Giờ kết thúc

source: Search schedule...
vi: Tìm lịch...

# addSchedule
source: Assign Schedule
vi: Xếp lịch

source: Edit Schedule
vi: Sửa lịch

source: Delete Schedule
vi: Xóa lịch

# confirmDeleteSchedule
source: Delete schedule for {name} on {date}?
vi: Xóa lịch của {name} ngày {date}?

# noScheduleFound
source: No schedules found
vi: Không tìm thấy lịch làm việc

# filterDate
source: Filter by Date
vi: Lọc theo ngày

# errorDuplicateSchedule
source: Conflict: This employee already has a shift on this date.
vi: Xung đột: Nhân viên này đã có ca làm việc trong ngày này rồi.

# errorUnknown
source: An unknown error occurred
vi: Đã xảy ra lỗi không xác định

# weavingTicketTitle
source: Weaving Tickets
vi: Phiếu Rổ Dệt

source: Date
vi: Ngày

source: Load date
vi: Ngày lên sợi

# tage
source: Tage weight
vi: Trọng lượng rổ

source: Time In
vi: Thời gian vào

source: Emp In
vi: Người vào

source: Time Out
vi: Thời gian ra

source: Emp Out
vi: Người ra

source: Ticket Code
vi: Mã phiếu

# machineInfo
source: Machine / Line
vi: Máy / Line

# yarnInfo
source: Yarn Lot / Date
vi: Lô sợi / Ngày nạp

# weightInfo
source: Gross / Net / Tare
vi: Tổng / Tịnh / Bì (kg)

# lengthKnots
source: Length (m) / Knots
vi: Dài (m) / Số nối

source: Splice
vi: Số mối nối

source: Bow
vi: Cong

# employees
source: Operators
vi: Nhân viên vận hành

source: Time In / Out
vi: Giờ Vào / Ra

# inspections
source: QC Inspections
vi: Kết quả kiểm tra QC

# addTicket
source: New Ticket
vi: Tạo phiếu mới

# addInspection
source: Add QC
vi: Thêm kiểm tra

# stageName
source: Stage
vi: Công đoạn

# gross
source: Gross Weight
vi: Tổng trọng lượng

source: Density
vi: Mật độ sợi ngang

source: Tension
vi: Lực căng

source: Bowing
vi: Độ lệch (Bowing)

source: Inspector
vi: Người kiểm tra

# noTicketSelected
source: Select a ticket to view details
vi: Chọn một phiếu để xem chi tiết

source: Delete Ticket
vi: Xóa phiếu

# confirmDeleteTicket
source: Delete ticket {code}?
vi: Xóa phiếu {code}?

source: Delete Inspection
vi: Xóa kiểm tra

# machineAndMaterial
source: Machine & Material
vi: Máy & Nguyên vật liệu

source: General Info
vi: Thông tin chung

source: Personnel
vi: Nhân sự

source: Results (Update Only)
vi: Kết quả (chỉ cập nhật)

source: Machine Operation
vi: Vận hành Máy dệt

# scanBarcodeSubline
source: Scan the basket code here to select your own items
vi: Quét mã rổ tại đây để tự chọn

# selectProductBefore
source: Select the product first
vi: Chọn sản phẩm trước

source: Assign Basket
vi: Gán rổ

# selectBasket
source: Select Ready Basket
vi: Chọn rổ sẵn sàng

# scanBarcode
source: Scan Barcode / Input Code
vi: Quét mã vạch / Nhập mã

source: View Ticket
vi: Xem phiếu

source: Edit ticket
vi: Sửa phiếu

source: Current Basket
vi: Rổ hiện tại

source: No active basket
vi: Trống

# confirmRelease
source: Finish this ticket and release basket?
vi: Kết thúc phiếu và ra rổ?

# basketAssigned
source: Basket assigned successfully
vi: Đã gán rổ thành công

# releaseBasket
source: Release Basket / Finish Ticket
vi: Ra rổ

source: Finish Ticket
vi: Kết thúc phiếu

# grossWeight
source: Gross Weight (kg)
vi: Trọng lượng cả bì (kg)

# netWeight
source: Net Weight (kg)
vi: Trọng lượng tịnh (kg)

# length
source: Length (m)
vi: Chiều dài (m)

# employeeOut
source: Receiver / Operator Out
vi: Người nhận / NV Tháo

source: Ticket Details
vi: Chi tiết Phiếu

source: Inspection History
vi: Lịch sử kiểm tra

source: New Inspection
vi: Kiểm tra mới

# confirmReleaseTitle
source: Confirm Finish
vi: Xác nhận kết thúc

# confirmReleaseMsg
source: Are you sure you want to finish this ticket and release the basket?
vi: Bạn có chắc muốn kết thúc phiếu này và tháo rổ ra không?

# saveSuccess
source: Saved successfully
vi: Lưu thành công

source: No tickets found for this date
vi: Không có phiếu sản xuất nào trong ngày này

source: No Basket
vi: Không có rổ

source: Production Info
vi: Thông tin sản xuất

# timeAndPersonnel
source: Time & Personnel
vi: Thời gian & nhân sự

source: Output
vi: Sản lượng

source: No inspections recorded
vi: Chưa có dữ liệu kiểm tra

source: Inspection
vi: Kiểm tra chất lượng

source: Measurements
vi: Thông số đo đạc

# userManagementTitle
source: User Management
vi: Quản lý Tài khoản

# searchUser
source: Search users (name, email)...
vi: Tìm tài khoản (tên, email)...

# noUserFound
source: No users found.
vi: Không tìm thấy tài khoản nào.

source: Last Login
vi: Đăng nhập cuối

source: Not Linked
vi: Chưa liên kết

source: Never
vi: Chưa từng

source: Add User
vi: Thêm tài khoản

source: Edit User
vi: Sửa tài khoản

source: Add New User
vi: Thêm tài khoản mới

source: Link to Employee
vi: Liên kết Nhân viên

# linkEmployeeHelper
source: Select an employee to link with this account
vi: Chọn nhân viên để liên kết với tài khoản này

# noEmployeeLinkedOption
source: --- No Employee Linked ---
vi: --- Không liên kết ---

# passwordRequiredNew
source: Required for new user
vi: Bắt buộc đối với tài khoản mới

# newPasswordPlaceholder
source: New Password (Leave blank to keep)
vi: Mật khẩu mới (Để trống nếu giữ nguyên)

source: Role
vi: Vai trò

# isActiveSwitch
source: Is Active
vi: Đang hoạt động

# isSuperuserSwitch
source: Is Superuser
vi: Là Superuser

# confirmDeleteTitle
source: Confirm Delete
vi: Xác nhận xóa

# confirmDeleteUserMsg
source: Are you sure you want to delete {name}?
vi: Bạn có chắc muốn xóa tài khoản {name}?

# prodStatsTitle
source: Production Statistics
vi: Thống Kê Sản Lượng

source: Export Excel
vi: Xuất Excel

source: Refresh Data
vi: Làm mới dữ liệu

source: Recalculate (Today)
vi: Tính toán lại (Hôm nay)

# searchProductHint
source: Search product code, note...
vi: Tìm theo mã sản phẩm, ghi chú...

# filterToday
source: Today
vi: Hôm nay

# filterYesterday
source: Yesterday
vi: Hôm qua

# filter7Days
source: Last 7 Days
vi: 7 ngày qua

# filterThisMonth
source: This Month
vi: Tháng này

# filterLastMonth
source: Last Month
vi: Tháng trước

# filterThisQuarter
source: This Quarter
vi: Quý này

# filterThisYear
source: This Year
vi: Năm nay

# filterCustom
source: Custom Date
vi: Tùy chọn ngày

source: Select Date
vi: Chọn ngày

source: TOTAL PRODUCTION
vi: TỔNG SẢN LƯỢNG

source: TOTAL LENGTH
vi: TỔNG CHIỀU DÀI

# itemCount
source: ITEMS
vi: SỐ MÃ

# noStatsData
source: No data for this period
vi: Không có dữ liệu cho giai đoạn này

source: Machines
vi: Máy

# copySuccess
source: Copied to clipboard!
vi: Đã sao chép vào bộ nhớ tạm!

# exporting
source: Creating Excel file...
vi: Đang tạo file Excel...

# exportError
source: Export error: {error}
vi: Lỗi xuất file: {error}
